clear;
clc;

f0 = 8000;        % فرکانس سیگنال
fs = 10000;        % فرکانس نمونه‌برداری
Ts = 1/fs;        % دوره نمونه‌برداری
t = 0:Ts:20;       % بازه زمانی (از صفر تا 1 ثانیه)

X = exp(1i*2*pi*f0*t); % سیگنال مختلط
y = real(X);           % بخش حقیقی سیگنال

L = length(y);         % طول سیگنال
%N = 10*L;              % اندازه FFT (بیشتر از طول سیگنال برای دقت بیشتر)
N=length(y);
Y = fft(y);% محاسبه FFT

f = (0:N-1)*(fs/N);    % محور فرکانس

plot(f,abs(Y));        % رسم دامنه سیگنال در حوزه فرکانس