clear;
clc;
close all

M=4;

f0 = 1000;        % فرکانس سیگنال
f1=  2000;
fs = 10000;        % فرکانس نمونه‌برداری
Ts = 1/fs;        % دوره نمونه‌برداری
t = 0:Ts:.005;       % بازه زمانی (از صفر تا 1 ثانیه)

X = (exp(1i*2*pi*f0*t)+exp(1i*2*pi*f1*t)); % سیگنال مختلط
y = real(X);           % بخش حقیقی سیگنال

L = length(y);         % طول سیگنال
%N = 10*L;              % اندازه FFT (بیشتر از طول سیگنال برای دقت بیشتر)
N=length(y);
Y = fft(y);% محاسبه FFT

f = (0:N-1)*(fs/N);    % محور فرکانس

yd=y(1:M:end);

plot(f,abs(y));

stem(y:1:1000);